; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-3 - location
	p1-5 - location
	p1-6 - location
	p3-4 - location
	p4-1 - location
	p5-2 - location
	p6-0 - location
	p6-3 - location
	p6-4 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s4)
	(at driver3 s6)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s1)
	(at package2 s0)
	(at package3 s0)
	(at package4 s4)
	(at package5 s5)
	(at package6 s6)
	(at package7 s1)
	(at package8 s5)
	(at package9 s6)
	(at package10 s3)
	(at package11 s2)
	(at package12 s3)
	(at package13 s6)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 38)
	(= (time-to-drive s4 s0) 38)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 70)
	(= (time-to-drive s2 s1) 70)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 28)
	(= (time-to-drive s6 s1) 28)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 27)
	(= (time-to-drive s6 s2) 27)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 69)
	(= (time-to-drive s1 s3) 69)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 85)
	(= (time-to-drive s5 s3) 85)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 29)
	(= (time-to-drive s1 s4) 29)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 85)
	(= (time-to-drive s2 s4) 85)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 73)
	(= (time-to-drive s3 s4) 73)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 35)
	(= (time-to-drive s6 s5) 35)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 55)
	(= (time-to-drive s0 s6) 55)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 93)
	(= (time-to-drive s4 s6) 93)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver3 s5)
	(at truck2 s4)
	(at truck3 s6)
	(at package1 s0)
	(at package2 s1)
	(at package3 s3)
	(at package4 s4)
	(at package5 s6)
	(at package6 s4)
	(at package7 s3)
	(at package8 s0)
	(at package9 s1)
	(at package10 s4)
	(at package11 s6)
	(at package12 s0)
	(at package13 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 16
2. (walk driver3 s6 p6-3)
   deleted: (at driver3 s6)
   added: (at driver3 p6-3)
   goals met: 1 of 16
3. (load-truck package7 truck2 s1)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 16
4. (load-truck package1 truck2 s1)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 1 of 16
5. (drive-truck truck2 s1 s4 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 0 to 377
   goals met: 2 of 16
6. (walk driver3 p6-3 s3)
   deleted: (at driver3 p6-3)
   added: (at driver3 s3)
   goals met: 2 of 16
7. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 2 of 16
8. (drive-truck truck3 s3 s5 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (fuel-used) from 377 to 1227
   goals met: 2 of 16
9. (load-truck package5 truck3 s5)
   deleted: (at package5 s5)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 2 of 16
10. (load-truck package8 truck3 s5)
   deleted: (at package8 s5)
   added: (in package8 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 2 of 16
11. (drive-truck truck2 s4 s6 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (fuel-used) from 1227 to 2436
   goals met: 1 of 16
12. (load-truck package13 truck2 s6)
   deleted: (at package13 s6)
   added: (in package13 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 1 of 16
13. (load-truck package6 truck2 s6)
   deleted: (at package6 s6)
   added: (in package6 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 1 of 16
14. (drive-truck truck2 s6 s4 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   changed: (fuel-used) from 2436 to 4296
   goals met: 2 of 16
15. (unload-truck package6 truck2 s4)
   deleted: (in package6 truck2)
   added: (at package6 s4)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 3 of 16
16. (drive-truck truck3 s5 s6 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 4296 to 4751
   goals met: 4 of 16
17. (unload-truck package5 truck3 s6)
   deleted: (in package5 truck3)
   added: (at package5 s6)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 5 of 16
18. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 4751 to 5919
   goals met: 4 of 16
19. (unload-truck package7 truck2 s3)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 5 of 16
20. (load-truck package10 truck2 s3)
   deleted: (at package10 s3)
   added: (in package10 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 5 of 16
21. (load-truck package12 truck2 s3)
   deleted: (at package12 s3)
   added: (in package12 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 5 of 16
22. (load-truck package9 truck3 s6)
   deleted: (at package9 s6)
   added: (in package9 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 5 of 16
23. (drive-truck truck2 s3 s4 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 5919 to 7379
   goals met: 6 of 16
24. (unload-truck package10 truck2 s4)
   deleted: (in package10 truck2)
   added: (at package10 s4)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 7 of 16
25. (drive-truck truck2 s4 s0 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 7379 to 7987
   goals met: 6 of 16
26. (unload-truck package12 truck2 s0)
   deleted: (in package12 truck2)
   added: (at package12 s0)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 7 of 16
27. (unload-truck package13 truck2 s0)
   deleted: (in package13 truck2)
   added: (at package13 s0)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 8 of 16
28. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 9 of 16
29. (load-truck package3 truck2 s0)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 9 of 16
30. (drive-truck truck3 s6 s1 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (fuel-used) from 7987 to 8351
   goals met: 8 of 16
31. (unload-truck package9 truck3 s1)
   deleted: (in package9 truck3)
   added: (at package9 s1)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 9 of 16
32. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 8351 to 9121
   goals met: 9 of 16
33. (load-truck package11 truck3 s2)
   deleted: (at package11 s2)
   added: (in package11 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 9 of 16
34. (drive-truck truck3 s2 s6 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 9121 to 9472
   goals met: 10 of 16
35. (unload-truck package11 truck3 s6)
   deleted: (in package11 truck3)
   added: (at package11 s6)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 11 of 16
36. (drive-truck truck2 s0 s4 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 9472 to 9890
   goals met: 12 of 16
37. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 9890 to 10693
   goals met: 11 of 16
38. (unload-truck package3 truck2 s3)
   deleted: (in package3 truck2)
   added: (at package3 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 12 of 16
39. (drive-truck truck3 s6 s0 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   changed: (fuel-used) from 10693 to 11298
   goals met: 11 of 16
40. (unload-truck package8 truck3 s0)
   deleted: (in package8 truck3)
   added: (at package8 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 12 of 16
41. (drive-truck truck3 s0 s6 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (fuel-used) from 11298 to 11848
   goals met: 13 of 16
42. (drive-truck truck2 s3 s4 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 11848 to 12578
   goals met: 14 of 16
43. (drive-truck truck2 s4 s1 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 12578 to 12868
   goals met: 13 of 16
44. (drive-truck truck3 s6 s0 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   changed: (fuel-used) from 12868 to 13418
   goals met: 12 of 16
45. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 12 of 16
46. (drive-truck truck3 s0 s6 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (fuel-used) from 13418 to 14023
   goals met: 13 of 16
47. (drive-truck truck3 s6 s5 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 14023 to 14408
   goals met: 12 of 16
48. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 13 of 16
49. (unload-truck package2 truck3 s5)
   deleted: (in package2 truck3)
   added: (at package2 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 13 of 16
50. (drive-truck truck2 s1 s6 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 14408 to 14688
   goals met: 13 of 16
51. (drive-truck truck2 s6 s5 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (fuel-used) from 14688 to 15038
   goals met: 13 of 16
52. (board-truck driver3 truck3 s5)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 12 of 16
53. (load-truck package2 truck3 s5)
   deleted: (at package2 s5)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 12 of 16
54. (drive-truck truck3 s5 s6 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 15038 to 15423
   goals met: 13 of 16
55. (drive-truck truck3 s6 s1 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (fuel-used) from 15423 to 15731
   goals met: 12 of 16
56. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 13 of 16
57. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 13 of 16
58. (drive-truck truck2 s5 s6 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 15731 to 16081
   goals met: 13 of 16
59. (drive-truck truck2 s6 s4 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   changed: (fuel-used) from 16081 to 17011
   goals met: 14 of 16
60. (walk driver3 s1 p1-5)
   deleted: (at driver3 s1)
   added: (at driver3 p1-5)
   goals met: 14 of 16
61. (walk driver3 p1-5 s5)
   deleted: (at driver3 p1-5)
   added: (at driver3 s5)
   goals met: 15 of 16
62. (walk driver2 s4 p4-1)
   deleted: (at driver2 s4)
   added: (at driver2 p4-1)
   goals met: 15 of 16
63. (walk driver2 p4-1 s1)
   deleted: (at driver2 p4-1)
   added: (at driver2 s1)
   goals met: 15 of 16
64. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 15 of 16
65. (drive-truck truck3 s1 s6 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s6)
   changed: (fuel-used) from 17011 to 17291
   goals met: 16 of 16
